#=======================================================================
# fastapi_review/dependencies.py
#  2026-06-29
#  공통 의존성 분리
#
#  의존성 주입
#     함수가 필요로 하는 것(의존성)을 직접 만들지 않고,
#     외부에서 만들어서 주입하는 패턴
#      
#     각 파일마다 똑같은 코드를 복붙 하면 나중에 수정할 때 모든 파일을 다 고쳐야 한다.
#     한 곳에 모아두면 수정할 때 이 파일 하나만 고치면 된다.
#======================================================================

from database import sessionLocal

def get_db():
    """DB 세션을 만들어서 엔드포인트에 주입해주는 함수
    엔드 포인트 함수에서 db: Session = Depends(get_db)로 사용

    세션 : DB와 주고 받는 대화 창구

    예)
    DB(데이터베이스) == 도서관
    엔진(engine) == 도서관 건물 자체 (한번만 만들고 계속 사용)
    세션(session) == 도서관 직원과의 대화 한번(용무 한번)
    
    return == 직원이 책 주고 도서관 문 닫기
    yield == 직원이 책 빌려주고 -> 손님이 다 볼때까지 기다렸다가 -> 반납 받고 정리
    """
    db = sessionLocal() # 새 DB 세션 생성(요처ㅏㅇ마다 새로 만들고 끝나면 닫는다)
    try:
        yield db # db를 넘겨주고 여기서 멈춘다 -> 엔드포인트 함수 실행 -> 이어서 실행
    finally:
        db.close() # 엔드포인트 성공/실패 관계없이 반드시 세션 닫는다 